#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-pagerduty_repo_53CC7100: Preparing import... [id=cdktn-provider-pagerduty]
data.github_team.cdktn-team-cdk-terrain: Reading...
github_repository.cdktn-provider-pagerduty-go_repo_5BC028E2: Preparing import... [id=cdktn-provider-pagerduty-go]
data.github_team.cdktn-team-cdk-terrain: Read complete after 5s [id=15746607]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-alert-prs-slack-webhook-url_70C7AC4F will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-alert-prs-slack-webhook-url_70C7AC4F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-gh-app-id-alias-PROJEN_APP_ID_35D0F33B will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-gh-app-id-alias-PROJEN_APP_ID_35D0F33B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-gh-app-id_0689F323 will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-gh-app-id_0689F323" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_7A034F67 will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_7A034F67" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-gh-app-private-key_EFC05FBA will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-gh-app-private-key_EFC05FBA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9819483B will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9819483B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3016E77A will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3016E77A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-gh-token_BAB085E2 will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-gh-token_BAB085E2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-npm-token_686BACF2 will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-npm-token_686BACF2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-twine-password_ECDCEFA6 will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-twine-password_ECDCEFA6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-pagerduty_repo_secret-twine-username_73E5CD83 will be created
  + resource "github_actions_secret" "cdktn-provider-pagerduty_repo_secret-twine-username_73E5CD83" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-pagerduty"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-pagerduty_repository-setup_main-protection_B43B635F will be created
  + resource "github_branch_protection" "cdktn-provider-pagerduty_repository-setup_main-protection_B43B635F" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-pagerduty"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-pagerduty-go_repository-setup_auto-approve-label_376345BC will be created
  + resource "github_issue_label" "cdktn-provider-pagerduty-go_repository-setup_auto-approve-label_376345BC" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-pagerduty-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-pagerduty-go_repository-setup_automerge-label_743F51AA will be created
  + resource "github_issue_label" "cdktn-provider-pagerduty-go_repository-setup_automerge-label_743F51AA" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-pagerduty-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-pagerduty-go_repository-setup_no-auto-close-label_29101FEB will be created
  + resource "github_issue_label" "cdktn-provider-pagerduty-go_repository-setup_no-auto-close-label_29101FEB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-pagerduty-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-pagerduty_repository-setup_auto-approve-label_7BB441E1 will be created
  + resource "github_issue_label" "cdktn-provider-pagerduty_repository-setup_auto-approve-label_7BB441E1" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-pagerduty"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-pagerduty_repository-setup_automerge-label_2EB90CD2 will be created
  + resource "github_issue_label" "cdktn-provider-pagerduty_repository-setup_automerge-label_2EB90CD2" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-pagerduty"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-pagerduty_repository-setup_no-auto-close-label_80A92931 will be created
  + resource "github_issue_label" "cdktn-provider-pagerduty_repository-setup_no-auto-close-label_80A92931" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-pagerduty"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-pagerduty-go_repo_5BC028E2 will be updated in-place
  # (imported from "cdktn-provider-pagerduty-go")
  ~ resource "github_repository" "cdktn-provider-pagerduty-go_repo_5BC028E2" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for pagerduty."
        etag                        = "W/\"96efc043b02196f7b4cdc872506040315d67db5ce4f3adef0771dc418c495697\""
        full_name                   = "cdktn-io/cdktn-provider-pagerduty-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-pagerduty-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-pagerduty-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-pagerduty-go.git"
        id                          = "cdktn-provider-pagerduty-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-pagerduty-go"
        node_id                     = "R_kgDORVdJCg"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1163348234
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-pagerduty-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-pagerduty-go"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "pagerduty",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-pagerduty_repo_53CC7100 will be updated in-place
  # (imported from "cdktn-provider-pagerduty")
  ~ resource "github_repository" "cdktn-provider-pagerduty_repo_53CC7100" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for pagerduty."
        etag                        = "W/\"c12476fe15ab09c91b9c729d4ba8d8b9ae6002aa61e66f52f508f1a8a048e998\""
        full_name                   = "cdktn-io/cdktn-provider-pagerduty"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-pagerduty.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-pagerduty"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-pagerduty.git"
        id                          = "cdktn-provider-pagerduty"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-pagerduty"
        node_id                     = "R_kgDORVdHvA"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1163347900
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-pagerduty.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-pagerduty"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "pagerduty",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-pagerduty_dependabot-security_DBC7E3D4 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-pagerduty_dependabot-security_DBC7E3D4" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-pagerduty"
    }

  # github_repository_webhook.cdktn-provider-pagerduty-go_repository-setup_slack-webhook_8D2691F2 will be created
  + resource "github_repository_webhook" "cdktn-provider-pagerduty-go_repository-setup_slack-webhook_8D2691F2" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-pagerduty-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-pagerduty_repository-setup_slack-webhook_B989BF84 will be created
  + resource "github_repository_webhook" "cdktn-provider-pagerduty_repository-setup_slack-webhook_B989BF84" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-pagerduty"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-pagerduty-go_repository-setup_managing-team_24C33AC0 will be created
  + resource "github_team_repository" "cdktn-provider-pagerduty-go_repository-setup_managing-team_24C33AC0" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-pagerduty-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-pagerduty_repository-setup_managing-team_B989968E will be created
  + resource "github_team_repository" "cdktn-provider-pagerduty_repository-setup_managing-team_B989968E" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-pagerduty"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (17 unchanged elements hidden)
        "github_repository.cdktn-provider-null_repo_41CFF515.ssh_clone_url",
      + "github_repository.cdktn-provider-pagerduty_repo_53CC7100.ssh_clone_url",
        "github_repository.cdktn-provider-postgresql_repo_8DD4A065.ssh_clone_url",
        # (5 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*